
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220334524)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # pagerduty_team.pd_team["poc"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "poc"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].data.pagerduty_team.team["poc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "pagerduty_team" "team" {
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "poc"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
pagerduty_team.pd_team["poc"]: Creating...
pagerduty_team.pd_team["poc"]: Creation complete after 1s [id=PVFT88T]
module.pd_team_association["imparapoc03@gmail.com"].data.pagerduty_team.team["poc"]: Reading...
module.pd_team_association["imparapoc03@gmail.com"].data.pagerduty_team.team["poc"]: Read complete after 0s [id=PVFT88T]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Creating...
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"]: Creation complete after 2s [id=POCJ4A2:PVFT88T]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"1bb62a846105ae648ef8bf7d9a492c7be4922325","Vars":{},"WorkflowName":"Plan"} -->